/*
Να γραφεί ένα πρόγραμμα, το οποίο θα κάνει τα εξής:
-   γράφει στην οθόνη: δώστε μια θερμοκρασία σε Φαρενάιτ
-   περιμένει δίπλα να διαβάσει μία ακέραια τιμή, την οποία αποδίδει
    στην τιμή ftemp
-   υπολογίζει την αντίστοιχη θερμοκρασία σε βαθμούς Κελσίου. Για F
    βαθμούς Φαρενάιτ, οι αντίστοιχοι βαθμοί Κελσίοτ C δίνονται από τον
    τύπο: C = (F - 32) * 5 / 9
-   γράφει στην οθόνη: Η θερμοκρασία είναι ----- βαθμοί Κελσίου. (αντί
    για τις παύλες να γράψετε τους βαθμούς Κελσίου)
*/

#include <stdio.h>

int main()
{
    float ftemp, ctemp;

    printf("Δώστε μια θερμοκρασία σε βαθμούς Φαρενάιτ:\t");
    scanf("%f", &ftemp);

    ctemp = (ftemp - 32) * 5 / 9;

    printf("Η ίδια θερμοκρασία είναι %.1f σε βαθμούς Κελσίου.\n", ctemp);

    return 0;
}
