/*
Να γραφεί ένα πρόγραμμα, το οποίο θα διαβάζει από το πληκτρολόγιο δύο float, οι οποίοι
αντιπροσωπεύουν τις δύο κάθετες πλευρές ενός ορθογωνίου τριγώνου. Το πρόγραμμα να
υπολογίζει και να γράφει στην οθόνη σε χώρο 8 διαστημάτων, με 2 κλασματικά ψηφία το
εμβαδόν του ορθογωνίου τριγώνου.
*/

#include <stdio.h>

int main()
{
    float side_a, side_b, area;

    printf("Δώσε το μήκος μίας κάθετης πλευράς του ορθογωνίου τριγώνου:\n");
    scanf("%f", &side_a);
    printf("Δώσε το μήκος της άλλης κάθετης πλευράς του ορθογωνίου τριγώνου:\n");
    scanf("%f", &side_b);

    area = side_a * side_b / 2;

    printf("Το εμβαδόν του ορθογωνίου τριγώνου είναι:\n%8.2f\n", area);

    return 0;
}
