/*
Να γραφεί πρόγραμμα, το οποίο θα διαβάζει από το πληκτρολόγιο ένα ακέραιο, ο οποίος αντιπροσωπεύει
μια γωνία σε μοίρες. Το πρόγραμμα να υπολογίζει και να γράφει στην οθόνη σε χώρο 10 διαστημάτων, με
6 κλασματικά ψηφία το μέγεθος της γωνίας σε ακτίνια (rad). Υπενθίμιση: οι 180 μοίρες αντιστοιχούν σε
π ακτίνια, δηλαδή (προσεγγιστικά) σε 3.14 ακτίνια.
*/

#include <stdio.h>
#include <math.h>

int main()
{
    int a_degrees;
    float a_radians;

    printf("Δώσε μία γωνία σε μοίρες:\n");
    scanf("%i", &a_degrees);

    a_radians = a_degrees * M_PI / 180;

    printf("Η ίδια γωνία σε ακτίνια είναι:\n%10.6f\n", a_radians);

    return 0;
}
