/*
Να γραφεί ένα πρόγραμμα, το οποίο θα υπολογίζει το φόρο που 
πληρώνει ένας μισθωτός, ως εξής:
-   Γράφει στην οθόνη: Δώστε τον μισθό.
-   Περιμένει να διαβάσει μια μεταβλητή float τιμή, την mis, 
    η οποία αντιπροσωπεύει τον μηνιαίο μισθό του μισθωτού.
-   Υπολογίζει τον συνολοικό μισθό για ένα έτος.
-   Γράφει στην οθόνη: Δώστε τα έξοδα.
-   Περιμένει να διαβάσει μια float τιμή, την exd, η οποία
    αντιπροσωπεύει τα έξοδα που κάνει ο μισθωτός σε έναν μήνα.
-   Υπολογίζει τα συνολοικά έξοδα για ένα έτος.
-   Υπολογίζει το φορολογητέο ποσό fp, που ισούται με το 
    συνολικό μισθό μείον τα συνολικά έξοδα.
-   Τέλος, υπόλογίζει τον φόρο, ο οποίος ισούται με το 10%
    του φορολογητέου ποσού και τον γράφει στην οθόνη σε χώρο 10
    διαστημάτων, με 2 κλασματικά ψηφία.
*/

#include <stdio.h>

int main()
{
    float mis, exd, fp;

    printf("Δώστε τον μισθό:\n");
    scanf("%f", &mis);
    mis *= 12;

    printf("Δώστε τα έξοδα:\n");
    scanf("%f", &exd);
    exd *= 12;

    fp = (mis - exd) * 0.1;

    printf("Ο φόρος είναι:\n%10.2f\n", fp);

    return 0;
}
