/*
Να γραφεί πρόγραμμα, το οποίο θα κάνει τα εξής:
-   Θα γράφει στην οθόνη "Δώστε αριθμό δευτερολέπτων"
-   Θα περιμένει να διαβάσει ένα ακέραιο, τον sec, ο 
    οποίος αντιστοιχεί σε αριθμό δευτερολέπτων.
-   Το πρόγραμμα στη συνέχει θα υπολογίζει από πόσα
    λεπτά (συμβολίστε τα με min) αποτελείται ο sec
    και πόσα δευτερόλεπτα περισσεύουν (συμβολίστε τα
    με left). Αν για παράδειγμα ο sec ισούται με 389,
    τότε το min θα είναι 6 και το left θα είναι 29.
-   Το πρόγραμμα να γράφει στην οθόνη τις τιμές των
    min και left, την κάθε μια σε χώρο 3 διαστημάτων.
*/

#include <stdio.h>

int main()
{
    int sec, min, left;

    printf("Δώστε αριθμό δευτερολέπτων:\n");
    scanf("%i", &sec);

    left = sec % 60;
    min = (sec - left) / 60;

    printf("%3i%3i\n", min, left);

    return 0;
}
